app/controllers/projects_controller.rb

SELECT `projects`.* FROM `projects`
---
  def index
    project_permissions = ProjectPermission.where(:user => current_user)
    @my_projects = project_permissions.select{ |pp| pp.user.can? :manage, pp.project }.map(&:project)

SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = ? LIMIT 1  [["id", "explore"]]
---
  def show
    project_permissions = ProjectPermission.where(:project => @project)
    @permissions = project_permissions.select{ |pp| pp.user.can? :read, pp.project }